# DataFrame

In [1]:
#SYNTAX  : pd.DataFrame(data,index,columns,dtype,copy)

In [1]:
import pandas as pd

Crate the DataFrame

In [ ]:
# Ways to 
1.list
2.dict
3.ndarrays

In [3]:
df=pd.DataFrame()

In [4]:
df

Empty DataFrame
Columns: []
Index: []

2. Create a DataFrame using List

In [6]:
data=[7,8,44,56,23,98]
df=pd.DataFrame(data)

In [7]:
df

    0
0   7
1   8
2  44
3  56
4  23
5  98

In [10]:
data=[["Dog","Bhaw-Bhaaw"],["Cat","Meow"],["Cow","Moo"]]
df=pd.DataFrame(data,columns=["Animal_name","Animal_sound"])

In [9]:
df

     0           1
0  Dog  Bhaw-Bhaaw
1  Cat        Meow
2  Cow         Moo

In [11]:
df

  Animal_name Animal_sound
0         Dog   Bhaw-Bhaaw
1         Cat         Meow
2         Cow          Moo

In [12]:
data=[["Dog","Bhaw-Bhaaw"],["Cat","Meow"],["Cow","Moo"]]
df=pd.DataFrame(data,columns=["Animal_name"])

ValueError: 1 columns passed, passed data had 2 columns

In [13]:
data={"Name":["Ram","Rahul","Bhwana"],"Age":[25,20,18]}
df=pd.DataFrame(data)

In [14]:
df

     Name  Age
0     Ram   25
1   Rahul   20
2  Bhwana   18

In [15]:
data={"Name":["Ram","Rahul","Bhwana"],"Age":[25,20,18]}
df=pd.DataFrame(data,index=["A","B","C"])

In [16]:
df

     Name  Age
A     Ram   25
B   Rahul   20
C  Bhwana   18

In [17]:
data={"Name":["Ram","Rahul","Bhwana"],"Age":[25,20,18]}
df=pd.DataFrame(data,index=["A","B","C","D"])

ValueError: Length of values (3) does not match length of index (4)

create a Dataframe using Series Datastructure

In [18]:
data={"Karan_Masrks":pd.Series([50,77,65],index=["Test1","Test2","Test3"]),
      "Arjun_Marks":pd.Series([67,89,32,98,50],index=["Test1","PTest1","Test2","PTest2","Test3"])}
df=pd.DataFrame(data)

In [19]:
df

        Karan_Masrks  Arjun_Marks
PTest1           NaN           89
PTest2           NaN           98
Test1           50.0           67
Test2           77.0           32
Test3           65.0           50

In [20]:
data={"Karan_Masrks":pd.Series([50,77,65,98],index=["Test1","Test2","Test3","Test4"]),
      "Arjun_Marks":pd.Series([67,89,32,98,50],index=["Test-1","PTest1","Test-2","PTest2","Test3"])}
df=pd.DataFrame(data)

In [21]:
df

        Karan_Masrks  Arjun_Marks
PTest1           NaN         89.0
PTest2           NaN         98.0
Test-1           NaN         67.0
Test-2           NaN         32.0
Test-3           NaN         50.0
Test1           50.0          NaN
Test2           77.0          NaN
Test3           65.0          NaN
Test4           98.0          NaN

In [26]:
data={"Karan_Masrks":pd.Series([50,77,65],index=["Test1","Test2","Test3"]),
      "Arjun_Marks":pd.Series([67,89,32,98,50],index=["Test1","PTest1","Test2","PTest2","Test3"])}
df=pd.DataFrame(data,columns=("A","B"),index=["AA","AB"])

In [27]:
df
# if columns headings are changed to A & B and all the Value ->NaN
#if only columns headings are changed to A& B But the data remain the same

      A    B
AA  NaN  NaN
AB  NaN  NaN

5. create a DatFrame from list of Dictionary

In [30]:
data=[{"A":1,"B":2,"C":90},{"C":3,"D":4},{"E":5,"F":6}]
df=pd.DataFrame(data)

In [31]:
df

     A    B     C    D    E    F
0  1.0  2.0  90.0  NaN  NaN  NaN
1  NaN  NaN   3.0  4.0  NaN  NaN
2  NaN  NaN   NaN  NaN  5.0  6.0

In [32]:
data=[{"A":1,"B":2},{"C":3,"D":4},{"E":5,"F":6}]
df=pd.DataFrame(data,index=["X","Y","Z"])

In [33]:
df

     A    B    C    D    E    F
X  1.0  2.0  NaN  NaN  NaN  NaN
Y  NaN  NaN  3.0  4.0  NaN  NaN
Z  NaN  NaN  NaN  NaN  5.0  6.0

# Update

In [13]:
data=[10,20,30,40,50,60,70]
data1=[100,200,300,400,500,600,700]
df=pd.DataFrame([data,data1],columns=['A',"B","C","D","E","F","G"])

In [14]:
df

     A    B    C    D    E    F    G
0   10   20   30   40   50   60   70
1  100  200  300  400  500  600  700

1.ColumnSelection

In [16]:
df["F"]

0     60
1    600
Name: F, dtype: int64

2.Add a column

In [17]:
df["H"]=[56,78]

In [18]:
df

     A    B    C    D    E    F    G   H
0   10   20   30   40   50   60   70  56
1  100  200  300  400  500  600  700  78

In [20]:
df["M"]=pd.Series([56,78,98])   # 98 is exclusive because according length of value is not match indexes

In [21]:
df

     A    B    C    D    E    F    G   H   M
0   10   20   30   40   50   60   70  56  56
1  100  200  300  400  500  600  700  78  78

In [22]:
df["N"]=pd.Series([56])

In [24]:
df

     A    B    C    D    E    F    G   H   M     N
0   10   20   30   40   50   60   70  56  56  56.0
1  100  200  300  400  500  600  700  78  78   NaN

In [33]:
df["Z"]=pd.Series([56,78,98,89],index=[0,1,2,3])

In [34]:
df

     A    B    C    D    E    F    G   H   M     N   Z
0   10   20   30   40   50   60   70  56  56  56.0  56
1  100  200  300  400  500  600  700  78  78   NaN  78

In [35]:
df["Y"]=pd.Series([1,2,3,4],index=['A',"B","C","D"])   # maping is not possible between index |Y Value Are [NaN,NaN]

In [36]:
df

     A    B    C    D    E    F    G   H   M     N   Z   Y
0   10   20   30   40   50   60   70  56  56  56.0  56 NaN
1  100  200  300  400  500  600  700  78  78   NaN  78 NaN

# Delete

In [37]:
del df['N']     # using del keyword

In [38]:
df

     A    B    C    D    E    F    G   H   M   Z   Y
0   10   20   30   40   50   60   70  56  56  56 NaN
1  100  200  300  400  500  600  700  78  78  78 NaN

In [40]:
#using Pop function
df.pop('Z')

0    56
1    78
Name: Z, dtype: int64

In [41]:
df

     A    B    C    D    E    F    G   H   M   Y
0   10   20   30   40   50   60   70  56  56 NaN
1  100  200  300  400  500  600  700  78  78 NaN

In [43]:
df[['C']]

     C
0   30
1  300

In [45]:
df[['E','A',"H"]]

     E    A   H
0   50   10  56
1  500  100  78

In [49]:
# del df['D','Y']    #-> KeyERROR

In [51]:
df.pop("D","Y")

TypeError: DataFrame.pop() takes 2 positional arguments but 3 were given

3.Multiple columns Delete

In [55]:
#drop
df.drop(["D","Y"],axis=1)   # temporary delete

     A    B    C    E    F    G   H   M
0   10   20   30   50   60   70  56  56
1  100  200  300  500  600  700  78  78

In [56]:
df

     A    B    C    D    E    F    G   H   M   Y
0   10   20   30   40   50   60   70  56  56 NaN
1  100  200  300  400  500  600  700  78  78 NaN

In [61]:
df["N"]=pd.Series([56])

In [62]:
df['P']=df["E"]  + df["N"]

In [63]:
df

     A    B    C    D    E    F    G   H   M   Y      P     N
0   10   20   30   40   50   60   70  56  56 NaN  106.0  56.0
1  100  200  300  400  500  600  700  78  78 NaN    NaN   NaN

In [64]:
df["P"]  + df["N"]

0    162.0
1      NaN
dtype: float64

In [65]:
df["Y"]  + df["N"]

0   NaN
1   NaN
dtype: float64

In [83]:
data=[{"A":45,"B":98,"P":104}]
df1=pd.DataFrame(data)

In [77]:
df=df.append(df1)

AttributeError: 'DataFrame' object has no attribute 'append'

As of pandas version 2.0, the append() method has been deprecated and removed. 
Previously, you could use append() to concatenate DataFrames, 
but now you should use concat() instead.

In [84]:
df = pd.concat([df, df1])

In [85]:
df

     A    B      C      D      E      F      G      P
0   10   20   30.0   40.0   50.0   60.0   70.0    NaN
1  100  200  300.0  400.0  500.0  600.0  700.0    NaN
0   45   98    NaN    NaN    NaN    NaN    NaN  104.0
0   45   98    NaN    NaN    NaN    NaN    NaN  104.0

In [86]:
df1

    A   B    P
0  45  98  104

In [87]:
#df1.insert(location,name_of_columns,data)

In [89]:
df1.insert(2,"Bye-Bye",[100])

In [90]:
df1

    A   B  Bye-Bye    P
0  45  98      100  104

In [92]:
df1.insert(2,"Bank",100)

In [93]:
df1

    A   B  Bank  Bye-Bye    P
0  45  98   100      100  104